In [4]:
import pandas as pd

ride_sharing = pd.read_csv("./datasets/ride_sharing_new.csv")
ride_sharing.head()

,Unnamed: 0,duration,station_A_id,station_A_name,station_B_id,station_B_name,bike_id,user_type,user_birth_year,user_gender
0,0,12 minutes,81,Berry St at 4th St,323,Broadway at Kearny,5480,2,1959,Male
1,1,24 minutes,3,Powell St BART Station (Market St at 4th St),118,Eureka Valley Recreation Center,5193,2,1965,Male
2,2,8 minutes,67,San Francisco Caltrain Station 2 (Townsend St...,23,The Embarcadero at Steuart St,3652,3,1993,Male
3,3,4 minutes,16,Steuart St at Market St,28,The Embarcadero at Bryant St,1883,1,1979,Male
4,4,11 minutes,22,Howard St at Beale St,350,8th St at Brannan St,4626,2,1994,Male

In [5]:
ride_sharing.info()

<class 'pandas.DataFrame'>
RangeIndex: 25760 entries, 0 to 25759
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Unnamed: 0       25760 non-null  int64
 1   duration         25760 non-null  str
 2   station_A_id     25760 non-null  int64
 3   station_A_name   25760 non-null  str
 4   station_B_id     25760 non-null  int64
 5   station_B_name   25760 non-null  str
 6   bike_id          25760 non-null  int64
 7   user_type        25760 non-null  int64
 8   user_birth_year  25760 non-null  int64
 9   user_gender      25760 non-null  str
dtypes: int64(6), str(4)
memory usage: 2.0 MB

In [6]:
ride_sharing.describe()

,Unnamed: 0,station_A_id,station_B_id,bike_id,user_type,user_birth_year
count,25760.000000,25760.000000,25760.000000,25760.000000,25760.000000,25760.000000
mean,12879.500000,31.023602,89.558579,4107.621467,2.008385,1983.054969
std,7436.415803,26.409263,105.144103,1576.315767,0.704541,10.010992
min,0.000000,3.000000,3.000000,11.000000,1.000000,1901.000000
25%,6439.750000,15.000000,21.000000,3106.000000,2.000000,1978.000000
50%,12879.500000,21.000000,58.000000,4821.000000,2.000000,1985.000000
75%,19319.250000,67.000000,93.000000,5257.000000,3.000000,1990.000000
max,25759.000000,81.000000,383.000000,6638.000000,3.000000,2001.000000

In [7]:
ride_sharing['user_type_cat'] = ride_sharing['user_type'].astype('category')
ride_sharing.info()

<class 'pandas.DataFrame'>
RangeIndex: 25760 entries, 0 to 25759
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Unnamed: 0       25760 non-null  int64
 1   duration         25760 non-null  str
 2   station_A_id     25760 non-null  int64
 3   station_A_name   25760 non-null  str
 4   station_B_id     25760 non-null  int64
 5   station_B_name   25760 non-null  str
 6   bike_id          25760 non-null  int64
 7   user_type        25760 non-null  int64
 8   user_birth_year  25760 non-null  int64
 9   user_gender      25760 non-null  str
 10  user_type_cat    25760 non-null  category
dtypes: category(1), int64(6), str(4)
memory usage: 2.0 MB

In [8]:
ride_sharing['user_type_cat'].describe()

count     25760
unique        3
top           2
freq      12972
Name: user_type_cat, dtype: int64

In [9]:
ride_sharing['duration_trim'] = ride_sharing['duration'].str.strip("minutes")
ride_sharing['duration_trim']

0        12
1        24
2         8
3         4
4        11
        ...
25755    11
25756    10
25757    14
25758    14
25759    29
Name: duration_trim, Length: 25760, dtype: str

In [10]:
ride_sharing['duration_time'] = ride_sharing['duration_trim'].astype('int')
ride_sharing['duration_time']

0        12
1        24
2         8
3         4
4        11
         ..
25755    11
25756    10
25757    14
25758    14
25759    29
Name: duration_time, Length: 25760, dtype: int64

In [11]:
assert ride_sharing['duration_time'].dtype == 'int'

In [12]:
print(ride_sharing['duration_time'].mean())

11.389052795031056

## Data range constraints
How to deal with out of range data?
* Dropping data
* Setting custom minimums and maximums
* Treat as missing and impute
* Setting custom value depending on business assumptions.

In [13]:
import datetime as dt
today_date = dt.date.today()
today_date

datetime.date(2026, 2, 22)

## Finding duplicates

In [14]:
duplicates = ride_sharing[ride_sharing.duplicated()]
duplicates

Empty DataFrame
Columns: [Unnamed: 0, duration, station_A_id, station_A_name, station_B_id, station_B_name, bike_id, user_type, user_birth_year, user_gender, user_type_cat, duration_trim, duration_time]
Index: []

In [19]:
banking = pd.read_csv("./datasets/restaurants_L2_dirty.csv")
banking.head()

,Unnamed: 0,name,addr,city,phone,type
0,0,kokomo,6333 w. third st.,la,2139330773,american
1,1,feenix,8358 sunset blvd. west,hollywood,2138486677,american
2,2,parkway,510 s. arroyo pkwy .,pasadena,8187951001,californian
3,3,r-23,923 e. third st.,los angeles,2136877178,japanese
4,4,gumbo,6333 w. third st.,la,2139330358,cajun/creole

In [17]:
banking_duplicaes = banking[banking.duplicated()]
banking_duplicaes

Empty DataFrame
Columns: [Unnamed: 0, cust_id, birth_date, Age, acct_amount, inv_amount, fund_A, fund_B, fund_C, fund_D, account_opened, last_transaction]
Index: []